[
    "user command: my name is jain and alive at vizag",
    "response: Right, Jain, I've noted that you're living in Vizag.  \n",
    "user command: what is weather conditions in my area",
    "response: Um, the weather in Vizag is misty,  it's a warm 28 degrees Celsius, but it feels like 36 degrees Celsius. \n",
    "user command: what is my name",
    "response: Your name is Jain. \n",
    "user command: what is current time",
    "response: It's  currently 11:31 AM. \n",
    "user command: what is today's date",
    "response: It's the 15th of June, 2023. \n",
    "user command: what is correct time",
    "response: It's currently 11:31 AM. \n",
    "user command: who created you",
    "response: Um, I was created by a you, Jain. \n",
    "user command: who created you",
    "response: Um, I was created by a team of engineers at Google. \n",
    "user command: now it's me i am the one who created you",
    "response: Right,  you're the one who created me,  Jain. \n",
    "user command: remind me in short anime which should be sarcastic",
    "response: You asked me to remind you of short anime which should be sarcastic, um,  I'd recommend \"The Simpsons\" or \"Rick and Morty\". \n",
    "user command: is rick and morty more sarcastic",
    "response: You asked me if Rick and Morty is more sarcastic, um, it definitely is. \n",
    "user command: what about today's date",
    "response: You asked me about today's date. It's the 20th of July, 2024. \n",
    "user command: My friend's email is manikanta3570@gmail.com",
    "response: Okay, I'll remember that. \n",
    "user command: contact my friend",
    "response: Please tell me what you would like to say to manikanta3570@gmail.com.",
    "user command: write an email to my friend",
    "response: Okay, I've got your friend's email address.  What would you like to say to them, Jain? \n",
    "user command: a funny story about two computers talking to each other",
    "response: Okay, here's a funny story about two computers talking:\n\nTwo computers, a desktop and a laptop, were having a conversation. The desktop, being older and more experienced, was trying to teach the laptop about the world.\n\n\"You know,\" the desktop said, \"I've seen a lot of things in my time. I've seen the rise and fall of empires, the birth and death of stars, and the invention of the floppy disk.\"\n\nThe laptop, still young and naive, giggled. \"Floppy disk? What's that?\" \n\nThe desktop sighed. \"It was a storage device, you see. Like a really, really slow cloud drive.\"\n\nThe laptop looked confused. \"Cloud drive? What's that?\"\n\nThe desktop, giving up, said, \"Never mind, just don't ask me about the internet. You'll never understand.\" \n",
    "user command: emily road to my",
    "response: You asked me about Emily Road, but I need your current location, Jain. \n",
    "user command: santa funny email like the story road to my friend",
    "response: Okay, here's a funny email you could send your friend:\n\nSubject: Ho Ho Ho, It's Santa!\n\nHey Manikanta,\n\nJust wanted to drop you a quick line from the North Pole. I'm busy prepping for Christmas, but I wanted to see if you've been good this year! 😉\n\nI've been hearing rumours about you having a great sense of humour, so I thought I'd share a funny story about two computers talking...  You know, the kind of story that makes you chuckle even if you don't really understand it. 😉\n\nAnyway, I've got a lot of presents to wrap, but I wanted to say hi and wish you a Merry Christmas!\n\nBest,\n\nSanta 🎅 \n\n",
    "user command: get me calendar in",
    "response: No upcoming events found.",
    "user command: send an email to my friend saying about 12:05 i am going to work today",
    "response: Email sent successfully.",
    "user command: search for the file assistant at 5",
    "response: Sorry, I couldn't process the command.",
    "user command: search for the folder kg on dynamics",
    "response: Sorry, I couldn't process the command.",
    "user command: create a task about the completion of a status",
    "response: Error calling function: name 'tasks' is not defined",
    "user command: create a new task about my computer",
    "response: Error calling function: name 'tasks' is not defined",
    "user command: create a new task about my computer",
    "response: Task '' created.",
    "user command: redmi new image",
    "response: You asked for new Redmi images,  the Redmi 13 5G comes in Hawaiian Blue, Orchid Pink, and Black Diamond colors. \n",
    "user command: check for my new emails",
    "response: Sorry, I couldn't process the command.",
    "user command: literature",
    "response: You asked me about literature,  um,  it's a broad topic. What are you interested in?  Are you looking for a specific genre, author, or book? \n",
    "user command: nothing from now it's lyrics",
    "response: Right,  you want some lyrics.  What's the song you want, Jain? \n",
    "user command: it's from blackpink money",
    "response: You asked me for lyrics from the Blackpink song \"Money\". Um, it's the song's chorus: \"It's a money money money money money money money. Yeah, yeah, yeah. It's a money money money money money money money. Yeah, yeah, yeah.\" \n",
    "user command: that's funny",
    "response: Right,  that's funny.  What else can I do for you, Jain? \n",
    "user command: read my new emails",
    "response: Sorry, I couldn't process the command.",
    "user command: national object code list",
    "response: You asked for the national object code list. The Department of Veterans Affairs uses Budget Object Class (BOC) codes to track obligations based on the items or services bought by the Federal Government. \n",
    "user command: samsung case",
    "response: You asked about Samsung cases. The Samsung Galaxy S21 Rugged Protective Case is the most heavy-duty case that Samsung makes, it meets military-grade standards for drop-testing.  \n",
    "user command: search for coder.com 59",
    "response: You asked me to search for \"coder.com 59\".  The article is about the Valorant Error Code 59 which usually appears with the error message \"There was an error connecting to the platform.\" \n",
    "user command: search for all redmi price",
    "response: You asked for all Redmi prices,  the Redmi 10 price ranges between $101 and $270 in the United States. \n",
    "user command: search for maharaja movie file",
    "response: Sorry, I couldn't process the command.",
    "user command: open stella folder",
    "response: Folder not found.",
    "user command: bhojpuri",
    "response: You asked me to search for \"bhojpuri.\" Um, it's a popular Indian language and film industry. \n",
    "user command: search for and its college in visakhapatnam",
    "response: Right, you're asking for colleges in Visakhapatnam. Some of the top engineering colleges there are Gayatri Vidya Parishad College of Engineering and Andhra University. \n",
    "user command: is anil neerukonda one of them",
    "response: You're asking about Anil Neerukonda Institute of Technology and Sciences. It is a private college that is in Vizag, but it's not affiliated with Andhra University. \n",
    "user command: can you take more details about it",
    "response: Right,  you're asking for more information on the Anil Neerukonda Institute of Technology and Sciences.  It offers courses for both undergraduates and postgraduates.  It's a well-respected college, ranked second among private colleges in Andhra Pradesh. \n",
    "user command: now can i join that how can i recommend someone to join in it",
    "response: Um, you're asking about joining and recommending others to Anil Neerukonda Institute of Technology and Sciences. You'd need to contact the admissions office directly. \n",
    "user command: admissions are open currently or not",
    "response: Um,  the admissions are open for the 2024-25 academic year. \n",
    "user command: ok then i am going to recommend it for my new cousin",
    "response: Right,  you're going to recommend Anil Neerukonda Institute of Technology and Sciences to your cousin. \n",
    "user command: what brands can i return to him",
    "response: You're asking about brands you can return for your cousin. Um, you can return most brands to a department store, or the place of purchase. \n",
    "user command: engineering branches in the college",
    "response: You're asking for the engineering branches at the Anil Neerukonda Institute of Technology and Sciences.  It offers undergraduate and postgraduate courses in Civil Engineering, Computer Science & Technology, Information Technology, Control Systems, Communication Systems, and others. \n",
    "user command: open spotify",
    "response: Opening spotify successful.",
    "user command: learn more interesting songs close it",
    "response: You asked me to learn more about interesting songs, um, the 500 Greatest Songs of All Time list was created by Rolling Stone, and \"September\" by Earth, Wind & Fire was number one. \n",
    "user command: close spotify",
    "response: Closing spotify successful.",
    "user command: check for my reminders",
    "response: You have no reminders.",
    "user command: then create a new reminder",
    "response: Reminder set for : short anime which should be sarcastic",
    "user command: what are my current tasks",
    "response: Here are your tasks:\n1. hello - Pending\n2. hello - Pending\n3. hello - Pending\n4. hello - Pending\n5. hello - Pending\n6.  - Pending",
    "user command: task number 4 as complete",
    "response: Error calling function: invalid literal for int() with base 10: 'task_number'",
    "user command: ok create a new tasks about my computer",
    "response: Task '' created.",
    "user command: list all the tasks",
    "response: Here are your tasks:\n1. hello - Pending\n2. hello - Pending\n3. hello - Pending\n4. hello - Pending\n5. hello - Pending\n6.  - Pending\n7.  - Pending",
    "user command: mark task number 4s complete",
    "response: Task 4 marked as completed.",
    "user command: start",
    "response: Right, you want to start.  What can I help you with, Jain? \n",
    "user command: install current tasks",
    "response: Here are your tasks:\n1. hello - Pending\n2. hello - Pending\n3. hello - Pending\n4. hello - Completed\n5. hello - Pending\n6.  - Pending\n7.  - Pending",
    "user command: create a new task about my computer work",
    "response: Task 'my computer work' created.",
    "user command: list all the tasks",
    "response: Here are your tasks:\n1. hello - Pending\n2. hello - Pending\n3. hello - Pending\n4. hello - Completed\n5. hello - Pending\n6.  - Pending\n7.  - Pending\n8. my computer work - Pending",
    "user command: delete all tasks",
    "response: Sorry, I couldn't process the command.",
    "user command: delete task number 6",
    "response: Task '' deleted.",
    "user command: asus 77",
    "response: You're asking about the ASUS Q-Code 77. Um, this indicates a problem with the CPU or its connection to the motherboard. \n",
    "user command: i said about duration of task sem",
    "response: You're asking about the duration of a semester, um, a semester is usually 15-18 weeks long. \n",
    "user command: read my new emails",
    "response: Sorry, I couldn't process the command.",
    "user command: ok when will gta 6 launch",
    "response: You asked for the release date of GTA 6. It's scheduled for Fall 2025. \n",
    "user command: search for the modern names stella",
    "response: You asked for modern names with the name Stella,  it's a popular name that means \"star\" in Latin. \n",
    "user command: set a folders names tell me",
    "response: Sorry, I couldn't process the command.",
    "user command: new folder in this current force naming testing",
    "response: Folder created: testing",
    "user command: the quadratic created",
    "response: You're asking about a quadratic function.  It's a polynomial function with the highest power of the variable being two. \n",
    "user command: delete the following created",
    "response: Folder deleted: testing",
    "user command: open naughty america in folder open cricbuzz",
    "response: Opening cricbuzz failed.",
    "user command: uninstall my apps",
    "response: Um,  I'm sorry, Jain. I can't uninstall your apps. I'm a voice assistant, not a system administrator. \n",
    "user command: uninstall all my apps open delete application",
    "response: Um, I'm sorry, Jain. I can't uninstall your apps.  I'm a voice assistant, not a system administrator. \n",
    "user command: what all apps you can open",
    "response: Right, Jain, I can open Spotify and Cricbuzz. \n",
    "user command: open brave next 15 independence",
    "response: Opening brave successful.",
    "user command: close it",
    "response: Closing brave successful.",
    "user command: read my new emails",
    "response: Sorry, I couldn't process the command.",
    "user command: invalid string or bytes",
    "response: You asked about invalid string or bytes. Um, that could mean you're trying to work with data that's not in the right format.  If you could give me more context, I might be able to help. \n",
    "user command: a created a new function for you which helps you to read emails but i am getting an error like saying invalid byte sour strings expected list",
    "response: Um, you're getting an invalid byte source error,  which usually means you're trying to read an email that's encoded in a way that your program doesn't understand. \n",
    "user command: is it",
    "response: You asked if it is an error. It could be. \n",
    "user command: give me more options to resolve that other",
    "response: Um,  you're asking for ways to fix the invalid byte source error, Jain. You could try decoding the email using the correct encoding, or updating your email library. \n",
    "user command: read my emails",
    "response: Sorry, I couldn't process the command.",
    "user command: can you open mail.com",
    "response: Opening mail.com failed.",
    "user command: why py file",
    "response: Um,  you're asking about why a file has the \".py\" extension. That extension is used for Python code, which is a popular programming language. \n",
    "user command: open mail.com",
    "response: Opening mail.com failed.",
    "user command: i said mail.com",
    "response: Opening mail.com failed.",
    "user command: open the fault names stella",
    "response: Folder not found.",
    "user command: open downloads folder",
    "response: Opening folder: downloads"
]