[
    "user command: my name is jain and alive at vizag",
    "response: Right, Jain, I've noted that you're living in Vizag.  \n",
    "user command: what is weather conditions in my area",
    "response: Um, the weather in Vizag is misty,  it's a warm 28 degrees Celsius, but it feels like 36 degrees Celsius. \n",
    "user command: what is my name",
    "response: Your name is Jain. \n",
    "user command: what is current time",
    "response: It's currently 11:31 AM. \n",
    "user command: who created you",
    "response: Um, I was created by a you, Jain. \n",
    "user command: who created you",
    "response: Right,  you're the one who created me,  Jain. \n",
    "user command: recommend me in short anime which should be sarcastic",
    "response: Um,  I'd recommend \"The Simpsons\" or \"Rick and Morty\". \n",
    "user command: is rick and morty more sarcastic",
    "response: Um, it definitely is. \n",
    "user command: what about today's date",
    "response: It's the 20th of July, 2024. \n",
    "user command: see whose is back",
    "response: Oh,  you're asking about who's back?  Well,  you've been back, Jain,  since you've been chatting with me.  It's been pretty interesting to say the least. \n",
    "user command: do you know what's today's date is?",
    "response: It's the 2nd of August, 2024.  It's a Friday, so I hope you have a great day, Jain! \n",
    "user command: it's been a long time",
    "response: Oh,  it has been a while!  It feels like we've been chatting for ages, Jain!  What are you up to today? \n",
    "user command: i should go to clg, at starts at 8:40 Am",
    "response: Reminder set for 8:40 AM: Go to college",
    "user command: what's the time right now?",
    "response: It's 7:38 AM.  Have a great day in college! \n",
    "user command: i need to fresh up, see u later",
    "response: Right, see you later Jain,  I'll be here when you get back.  Just remember,  you're always welcome to chat with your old pal, Stella.  \n",
    "user command: ❤️",
    "response: Oh,  Jain,  that's so sweet.  💖 You're the best.  😉 \n",
    "user command: create a new task project completion",
    "response: Task 'project completion' created."
]